from logic.session import Session


session: Session = Session.get()
session.runMainThread()

# Извините, не подумал… ) и правда, есть ведь и злые герои ) Заменю на что-нить другое…

# Вообще, обсуждение в жаббер-конференции уже выявило некоторые предложения и замечания, которые, вероятно, будут учтены в следующей версии :

# Научиться сворачиваться в трей
# По умолчанию опрашивать Годвилль раз в минуту, а не в 30 секунд
# Сделать разнообразные звуковые предупреждения о важных событиях
# Убрать минус из сообщения “Уменьшилось на -1”, к примеру
# Открывать новое окошко Годвилля по клику на каком-либо элементе управления
# Закрывать всплывающие окна правой кнопкой мыши, как в Квипе
# Как говорится, смотрите в следующих сериях… )

# Просмотреть, что может старая следилка и сравнить, что можно в этой следилке будет лучше